Repository: Marymezh/Struyach_Fitness
Catalog: Struyach Fitness/Localization/*.lproj/Localizable.strings
Languages: ru

source: STRUYACH FITNESS
ru: СТРУЯЧ ФИТНЕСС

source: Log In
ru: Войти

source: Create Account
ru: Создать учётную запись

source: Create new account
ru: Новая учётная запись

source: Restore Password
ru: Восстанoвить пароль

source: Forgot password
ru: Восстановить пароль

source: Password
ru: Пароль

source: Full name (how other users will see you)
ru: Имя (как вас будут видеть другие)

source: Password (minimum 6 symbols)
ru: Пароль (минимум 6 символов)

source: Confirm password
ru: Подтвердите пароль

source: Create
ru: Создать

source: Enter secret code to create admin account
ru: Введите секретный код администратора

source: Enter your email
ru: Введите e-mail

source: No such user! Check your e-mail
ru: Пользователь с таким адресом не найден, проверьте свой e-mail

source: Send
ru: Отправить

source: To restore your forgotten password please enter the email address of the registered user. You will receive an email with further instructions.
ru: Чтобы восстановить пароль, пожалуйста, введите адрес электронной почты зарегистрированного пользователя. Дальнейшие инструкции вы получите по email.

source: Email with instructions was successfully sent!
ru: Письмо с инструкциями по восстановлению пароля успешно отправлено!

source: Failed sending email: %@
ru: Письмо не отправлено: %@

source: Training Plans
ru: Планы тренировок

source: Coach Blog
ru: Блог тренера

source: Profile
ru: Профиль

source: Settings
ru: Настройки

source: Plans
ru: Планы

source: Blog
ru: Блог

source: Get fit and toned with our Bodyweight Training Plan - no equipment needed, perfect for on-the-go workouts!
ru: Тренировки с собственным весом, без дополнительного оборудования. В любое время, в любом месте!

source: Transform your body with our ECD Plan - designed for gym or CrossFit box training
ru: Базовый план клуба ECD. Разработан для тренировок в тренажерном зале или кроссфит-клубе

source: Take your training to the next level with our Struyach Plan - designed specifically for experienced athletes
ru: Тренировочный план для соревнующихся атлетов. Присоединяйся, если хочешь достичь большего!

source: Tone and strengthen your pelvic muscles with our 10 high-intensity workouts
ru: 10 высокоинтенсивных тренировок, направленных на укрепление мышц ног, бёдер и таза

source: Get rid of stubborn belly fat and achieve a leaner, fitter body with our 10 high-intensity workouts
ru: 10 тренировок напралвенных на укрепление мышц пресса.

source: No comments posted yet
ru: Комментариев пока нет

source: 1 comment
ru: 1 комментарий

source: %d comments
ru: Всего комментариев: %d

source: Write a comment...
ru: Оставьте свой комментарий...

source: SAVE
ru: Сохранить

source: Add new workout
ru: Новая тренировка

source: Add new post
ru: Новый пост

source: No workouts found for this program
ru: Здесь пока нет тренировок

source: Workout successfully deleted
ru: Тренировка успешно удалена

source: Edit workout
ru: Редактор тренировки

source: Edit post
ru: Редактор поста

source: Search for workouts
ru: Что будем искать?

source: Ooops! No workouts were found! Change your query and try again.
ru: Ой! По вашему запросу ничего не нашлось! Измените запрос и попробуйте снова!

source: Select workout from search results
ru: Выберите тренировку из результатов поиска

source: Back
ru: Назад

source: Comments
ru: Комментарии

source: Camera
ru: Камера

source: Uploading photo (%d%%)
ru: Загрузка фото (%d%%)

source: Error uploading image
ru: Не удалось загрузить фото

source: Photo
ru: Фото

source: Video
ru: Видео

source: Uploading video (%d%%)
ru: Загрузка видео (%d%%)

source: Error uploading video
ru: Не удалось загрузить видео

source: Couldn't get media URL from image picker
ru: Не удалось получить адрес видео

source: Unable to post comment
ru: Не удалось добавить комментарий

source: Unable to delete comment
ru: Не удалось удалить комментарий

source: Edit comment
ru: Редактор комментария

source: Unable to update selected comment
ru: Не удалось отредактировать выбранный комментарий

source: Updating photo (%d%%)
ru: Загрузка нового фото (%d%%)

source: Unable to update selected photo comment
ru: Не удалось отредактировать фото

source: Updating video (%d%%)
ru: Загрузка нового видео (%d%%)

source: Unable to update selected video comment
ru: Не удалось отредактировать видео

source: Reply to
ru: Ответить

source: Error
ru: Ошибка

source: Cancel
ru: Отменить

source: Warning
ru: Предупреждение

source: Success
ru: Готово

source: Done
ru: Готово

source: Failed
ru: Ошибка

source: Delete
ru: Удалить

source: Edit
ru: Редактировать

source: Save
ru: Сохранить

source: unknown error
ru: Неизвестная ошибка

source: Check your email
ru: Нет пользователя с указанным адресом электронной почты

source: Check your password
ru: Неправильный пароль

source: Unable to log in: There is no user record corresponding to this email. Check your email
ru: Невозможно выполнить вход: нет зарегистрированных пользователей с таким адресом. Проверьте написание адреса

source: Retry
ru: Пробовать снова

source: Unable to create new user
ru: Не удалось добавить нового пользователя

source: A user with this email already exists
ru: Пользователь с этим адресом уже существует

source: Password is too short. Use at least 6 symbols
ru: Пароль должен содержать минимум 6 символов

source: Passwords don't match!
ru: Пароли не совпадают!

source: Unable to post new workout
ru: Не удалось добавить новую тренировку

source: Unable to delete this workout
ru: Не удалось удалить выбранную тренировку

source: All workouts have been loaded
ru: Все тренировки загружены

source: This textfield can not be blank!
ru: Это текстовое поле не может быть пустым!

source: Workout is successfully updated!
ru: Тренировка успешно отредактирована

source: Post is successfully updated!
ru: Пост успешно отредактирован

source: Unable to add new post
ru: Не удалось добавить новый пост

source: Post is successfully deleted! No more posts left in the Blog
ru: Пост успешно удалён! В блоге больше не осталось постов

source: Post is successfully deleted!
ru: Пост успешно удалён!

source: Unable to delete selected post
ru: Не удалось удалить выбранный пост

source: All posts have been loaded
ru: Все посты загружены

source: Unable to log in the App Store: you can continue using the app, but won't be able to make in-app purchases
ru: Не удалось зарегистрировать в App Store: можно пользоваться приложением, но встроенные покупки недоступны

source: Change user name
ru: Изменить имя пользователя

source: Enter new name here
ru: Введите новое имя

source: User name can not be blank!
ru: Имя пользователя не может быть пустым!

source: User name is successfully changed
ru: Имя пользователя успешно изменено!

source: Are you sure you would like to sign out?
ru: Вы уверены, что хотите выйти из профиля?

source: Unable to log out
ru: Не удалось выйти

source: Unable to complete in-app purchase: %@
ru: Невозможно завершить покупку: %@

source: The secret code is wrong, you can not be registered as an admin!
ru: Секретный код не верный, вы не можете зарегистрироваться как администратор!

source: You are not authorized to sign in as an admin!
ru: У вас нет прав доступа к этому приложению!

source: Unable to open app rating page
ru: Не удалось открыть страницу приложения

source: You are not allowed to make purchases
ru: ВЫ не можете совершать покупки

source: Your message is successfully sent! Thank you for your feedback!
ru: Ваше сообщение успешно отправлено! Спасибо за обратную связь!

source: Your message is saved to drafts
ru: Черновик вашего сообщения успешно сохранен

source: Error sending message
ru: Сообщение не отправлено

source: Unable to log out from purchases
ru: Не удалось выйти за аккаунта магазина

source: Deleting your account will permanently remove all your data and cannot be undone. This action is irreversible. Before deleting your account, please consider the following: 1. Data Loss: All your personal information, including profile details, messages, and preferences, will be deleted and cannot be recovered. 2. Access Revocation: You will lose access to any associated services, features, or benefits linked to your account. 3. Subscription Cancellation: If you have an active subscription, deleting your account will not cancel any active subscriptions tied to your account, you have to cancel them on your own in Settings -> Apple ID -> Subscriptions. 4. Social Connections: Connections or interactions with other users, friends and coach may be lost. You will no longer be able to communicate with them through the platform. Please take your time to consider this decision carefully. If you have any concerns or questions, we recommend you to send a message to the developer for assistance before proceeding. To confirm the deletion of your account and proceed, tap "Delete Account". To cancel and retain your account, tap "Cancel".
ru: Удаление учетной записи приведет к безвозвратной потере всех ваших данных. Это действие нельзя отменить. Перед удалением учетной записи, пожалуйста, учтите следующее: 1. Потеря данных: Все ваши личные данные, включая информацию профиля, сообщения и предпочтения, будут удалены и не могут быть восстановлены. 2. Потеря доступа: Вы потеряете доступ к любым связанным услугам, функциям или преимуществам, связанным с вашей учетной записью. 3. Отмена подписки: Если у вас есть активные подписки, удаление учетной записи не приведет к их автоматической отмене. Вам необходимо самостоятельно отменить активные подписки в Настройки -> Apple ID -> Подписки. 4. Социальные связи: Связи или взаимодействия с другими пользователями, друзьями и тренером могут быть потеряны. Вы больше не сможете общаться с ними через эту платформу. Пожалуйста, тщательно обдумайте свое решение. Если у вас есть вопросы или опасения, мы рекомендуем написать разработчику для получения помощи перед продолжением. Чтобы подтвердить удаление учетной записи, нажмите "Удалить учётную запись". Чтобы отменить и сохранить учетную запись, нажмите "Отменить"

source: Delete Account
ru: Удалить учётную запись

source: Confirm
ru: Подтвердить

source: If you for sure want to permanently delete your account, please type "Confirm" below
ru: Если вы уверены, что хотите навсегда удалить свою учётную запись, напечатайте "Confirm" ниже

source: Account is successfully deleted
ru: Учётная запись удалена

source: Error occured, account is not deleted
ru: Ошибка: не удалось удалить учётную запись

source: Incorrect confirmation entry, check spelling
ru: Подтверждающее слово не верно

source: This operation is sensitive and requires recent authentication. Log in again before retrying this request
ru: Эта операция требует свежую аутентификацию. Чтобы закончить эту операцию необходимо выйти из учётной записи и снова зайти

source: Unknown user
ru: Неизвестный пользователь

source: Rename user
ru: Изменить имя

source: Sign Out
ru: Выйти

source: Personal Records
ru: Личные рекорды

source: %@ kg
ru: %@ кг

source: 00 kg
ru: 00 кг

source: App information
ru: Информация о приложении

source: Notifications settings
ru: Настройка уведомлений

source: Log out or delete account
ru: Выход и удаление учётной записи

source: User profile settings
ru: Настойки профиля пользователя

source: Language settings
ru: Выбор языка

source: About this app
ru: О приложении

source: Send email to developer
ru: Написать разработчику

source: App Feedback
ru: Отзыв о приложении

source: Dear Developer, I have some feedback about the app... Sincerely, [Your Name]
ru: Добрый день, Хочу поделиться своим мнением о приложении... С уважением, [Ваше имя]

source: Rate this app
ru: Оценить приложение

source: Hide email
ru: Скрыть email

source: Profile email is hidden
ru: Скрыть email в профиле

source: Subscription status
ru: Статус подписок

source: Manage subscriptions
ru: Управление подписками

source: %@ - is active until %@
ru: %@ - активна до %@

source: %@ - is purchased
ru: %@ - куплена

source: %@ - is not active
ru: %@ - не активна

source: purchased
ru: куплена

source: not active
ru: не активна

source: until %@
ru: до %@

source: Request a refund
ru: Запросить возврат

source: Sign out
ru: Выйти из учётной записи

source: Delete account and all data
ru: Удалить учётную запись

source: Welcome to our cosy fitness app! We understand that you want to achieve your fitness goals with a personalized touch, and that's exactly what we provide. Our app is not just another AI-generated workout plan - we believe in the power of experience and empathy. Meet Roman Mezhov, our experienced coach with over 12 years of coaching in various activities, including cycle, hot iron, cross-training, and more. With almost a decade of experience in creating training programs, Roman has crafted unique and effective plans that cater to your individual needs and abilities. In this app, you will have access to three monthly subscription training plans and two lifetime plans that will change your fitness game forever. The best part? Your coach is always available to answer your questions and provide feedback on your technique. Our commenting feature also allows you to share your progress with the coach and other users, creating a supportive community that encourages you every step of the way. Our Bodyweight plan is perfect for those who are always on-the-go, providing you with quick and effective workouts that require no special equipment. This plan is completely free, so there's no excuse not to get started today. Our ECD plan is the main training program, suitable for both beginners and intermediate-level athletes. With a full range of movements using common gym equipment, this well-balanced program will never leave you bored. Our Stryuach plan is for advanced athletes who are serious about pushing their limits and achieving visible progress. This plan is designed for competitive athletes who are in it to win it.By subscribing to this plan, you'll also get an access to our ECD Plan. In addition to these plans, we also offer two plans with ten high-intensity workouts each - Belly Burner and Pelvic Power. These plans are specifically designed to strengthen the muscles of the press and pelvic muscles, respectively. But that's not all - our app also gives you free access to our coach's blog, where you can read his thoughts and insights on working out and doing business in the fitness industry. In the Profile section, you can keep track of your personal records in weightlifting movements and share them with other users. Join our community and achieve your fitness goals with the help of our expert coach and personalized training plans. Start your fitness journey with us today!
ru: Приветствуем тебя в нашем уютном фитнес-приложении! Мы уверены, что в достижении ваших фитнес-целей требуется индивидуальный подход, и это именно то, что мы можем предложить. Наше приложение - это не еще один план тренировок, сгенерированный AI. Это качестенные продукты, основанные на многолетнем опыте работы тренера и составления тренировочных программ. Наш главный тренер - Роман Межов - имеет более 12 лет опыта работы по различным фитнес направлениям - от стэп аэробики и сайкла, до кросс-треннинга и гимнастики. Также он имеет богатый опыт написания тренировочных программ, как групповых, так и индивидуальных, учитывающих потребности и возможности каждого конкретного атлета. В этом приложении представлены три тренировочных плана по подписке и две отдельные программы с пожизненным доступом. Так чем же наше приложение отличается от многих аналогичных? Тренер всегда на связи и ответит на ваши вопросы, или даст оценку вашей технике, если это требуется. Просто не забывайте оставлять комментарии к тренировкам, делитесь своими результатами с тренером и другими участниками! Наш план Bodyweight отлично подойдет для тех, кто всгда в движении. Тут вы найдете короткие интенсивные тренировки, для выполнения которых не потребуется дополнительного оборудования, нужно только ваше желание, ваше тело, и капля свободного времени. Доступ к этому плану неограниченный, поэтому у вас нет никаких оправданий, чтобы не попробовать эти тренировки сегодня же ;) Наш план ECD - это базовый тренировочный план, который подходит как для начинающих, так и для продолжающих атлетов. Здесь представлены все возможные движения и упражнения с оборудованием, которое есть в спортзалах: штанги, гири, гантели, скакалки и турники, и многое другое, так что скучать точно не придётся! План Struyach разрабатывается для более продвинутых атлетов, которые хотят улучшить свои скиллы по всем направленям и участвовать в соревнованиях. Подписываясь на этот план вы также получаете бесплатный доступ к плану ECD! В дополнение к планам по подписке мы также предлагаем два плана, каждый из которых содержит по 10 высокоинтенсивных тренировок направленных на конкретные зоны - мышцы живота и мышцы таза и ног. Но и это еще не всё - в приложении вы также найдете Блог тренера, где он регулярно делится своими мыслями и инсайтами по поводу тренировок и ведения бизнеса в фитнес-индустрии. В разделе Профиль вы можете фиксировать свои персональные рекорды в основных тяжелоатлетических движениях и делиться ими с другими пользователями. Присоединяйтесь к нашему сообществу и добивайтесь своих фитнес-целей при поддержке тренера и других участниковю Начни свой путь с нами сегодня!

source: Restore purchases
ru: Восстановить покупки

source: Terms of Use
ru: Условия пользования

source: Subscribe to ECD Plan
ru: Подписаться на план ECD

source: Transform your body with our ECD Plan - designed for gym or CrossFit box training. Join today and start your fitness journey with us!
ru: Базовый план клуба ECD. Разработан для тренировок в тренажерном зале или кроссфит-клубе. Начни своё фитнес-путешествие с нами!

source: Start your 1-Week FREE Trial
ru: БЕСПЛАТНЫЙ пробный период - 1 неделя

source: Start your %d - %@ FREE trial
ru: БЕСПЛАТНЫЙ пробный период - %d %@

source: %@/month after trial
ru: Затем %@/месяц

source: Subscribe to STRUYACH Plan
ru: Подписаться на план СТРУЯЧ

source: Take your training to the next level with our Struyach Plan - designed specifically for experienced athletes Subscribing to Struyach Plan also gives you a free access to the ECD Plan! Join now!
ru: Тренировочный план для соревнующихся атлетов. Присоединяйся, если хочешь достичь большего! Подписываясь на план Струяч, вы также получаете бесплатный доступ к плану ECD! Подпишись сегодня!

source: 799 RUB/month after trial
ru: Затем 799 РУБ/месяц

source: Pelvic Power Plan
ru: Купить Pelvic Power Plan

source: Tone and strengthen your pelvic muscles with our 10 high-intensity workouts. Join today for a stronger, healthier you!
ru: 10 высокоинтенсивных тренировок, направленных на укрепление мышц ног, бёдер и таза. Присоединяйся, чтобы получить лучшую версию себя!

source: Buy now for 199 RUB
ru: Купить за 199 РУБ

source: Buy now for %@
ru: Купить за %@

source: Pay once and get life-time access
ru: Заплати один раз и пользуйся

source: Belly Burner Plan
ru: Купить Belly Burner Plan

source: Get rid of stubborn belly fat and achieve a leaner, fitter body with our 10 high-intensity workouts. Join today!
ru: 10 высокоинтенсивных тренировок, направленных на то, чтобы уничтожить упрямый жирок на животе, прокачать мышцы кора и получить более подтянутое и тренированное тело!

source: Subscribe now for %@/month
ru: Подпишись за %@ в месяц

source: Enter promo code
ru: Введите промо-код

source: Redeem promo code
ru: Активировать промо-код

source: Close
ru: Закрыть

source: day
ru: дня

source: week
ru: неделя

source: month
ru: месяц

source: year
ru: год

source: This is an auto-renewable subscription. It will be charged to your iTunes Account after the trial and before each pay period. You can cancel your subscription or turn off auto-renewal at any time by going into your Settings -> Apple ID -> Subscriptions. Restore purchases if previously subscribed.
ru: Это автоматически продлеваемая подписка. Её стоимость будет списана с вашего счёта в iTunes после окончания пробного периода и перед каждым периодом оплаты. Вы можете отменить подписку или отключить автопродление в любое время: «Настройки» -> Apple ID -> «Подписки». Восстановите покупки, если они ранее были оформлены.

source: Loading price and terms...
ru: Загружаем условия и цену...

source: Purchase is not available at the moment. Check your internet connection
ru: В данный момент покупка не доступна. Проверьте интернет-соединение

source: Unable to restore purchases: %@
ru: Не удалось восстановить покупки: %@

source: Your purchases are successfully restored!
ru: Ваши покупки успешно восстановлены!

source: Unable to syncronize purchases: %@
ru: Не удалось синхронизировать покупки: %@

source: This field can not be empty!
ru: Вы не ввели код!

source: Failed to open URL
ru: Ссылка не работает

source: Invalid URL
ru: Неверная ссылка
